[
  {
    "metadata": {
      "title": "Nvidia",
      "summary": "Nvidia Corporation (en-VID-ee-ə) is an American technology company headquartered in Santa Clara, California. Founded in 1993 by Jensen Huang (president and CEO), Chris Malachowsky, and Curtis Priem, it develops graphics processing units (GPUs), systems on chips (SoCs), and application programming interfaces (APIs) for data science, high-performance computing, and mobile and automotive applications. Originally focused on GPUs for video gaming, Nvidia broadened their use into other markets, including artificial intelligence (AI), professional visualization, and supercomputing. The company's product lines include GeForce GPUs for gaming and creative workloads, and professional GPUs for edge computing, scientific research, and industrial applications. As of the first quarter of 2025, Nvidia held a 92% share of the discrete desktop and laptop GPU market. In the early 2000s, the company invested over a billion dollars to develop CUDA, a software platform and API that enabled GPUs to run massively parallel programs for a broad range of compute-intensive applications. As a result, as of 2025, Nvidia controlled more than 80% of the market for GPUs used in training and deploying AI models, and provided chips for over 75% of the world's TOP500 supercomputers. The company has also expanded into gaming hardware and services, with products such as the Shield Portable, Shield Tablet, and Shield TV, and operates the GeForce Now cloud gaming service. It also developed the Tegra line of mobile processors for smartphones, tablets, and automotive infotainment systems. In 2023, Nvidia became the seventh U.S. company to reach a US$1 trillion valuation. In 2025, it became the first to surpass US$4 trillion in market capitalization, driven by rising global demand for data center hardware in the midst of the AI boom. For its strength, size and market capitalization, Nvidia has been selected to be one of Bloomberg's \"Magnificent Seven\", the seven biggest companies on the stock market in these regards.",
      "source": "https://en.wikipedia.org/wiki/Nvidia"
    },
    "page_content": "Nvidia Corporation (en-VID-ee-ə) is an American technology company headquartered in Santa Clara, California. Founded in 1993 by Jensen Huang (president and CEO), Chris Malachowsky, and Curtis Priem, it develops graphics processing units (GPUs), systems on chips (SoCs), and application programming interfaces (APIs) for data science, high-performance computing, and mobile and automotive applications. Originally focused on GPUs for video gaming, Nvidia broadened their use into other markets, including artificial intelligence (AI), professional visualization, and supercomputing. The company's product lines include GeForce GPUs for gaming and creative workloads, and professional GPUs for edge computing, scientific research, and industrial applications. As of the first quarter of 2025, Nvidia held a 92% share of the discrete desktop and laptop GPU market. In the early 2000s, the company invested over a billion dollars to develop CUDA, a software platform and API that enabled GPUs to run massively parallel programs for a broad range of compute-intensive applications. As a result, as of 2025, Nvidia controlled more than 80% of the market for GPUs used in training and deploying AI models, and provided chips for over 75% of the world's TOP500 supercomputers. The company has also expanded into gaming hardware and services, with products such as the Shield Portable, Shield Tablet, and Shield TV, and operates the GeForce Now cloud gaming service. It also developed the Tegra line of mobile processors for smartphones, tablets, and automotive infotainment systems. In 2023, Nvidia became the seventh U.S. company to reach a US$1 trillion valuation. In 2025, it became the first to surpass US$4 trillion in market capitalization, driven by rising global demand for data center hardware in the midst of the AI boom. For its strength, size and market capitalization, Nvidia has been selected to be one of Bloomberg's \"Magnificent Seven\", the seven biggest companies on the stock market in these regards.\n\n== History ==\n\n=== Founding ===\n\nNvidia was founded on April 5, 1993, by Jensen Huang (who remains CEO), a Taiwanese-American electrical engineer who was previously the director of CoreWare at LSI Logic and a microprocessor designer at AMD; Chris Malachowsky, an engineer who worked at Sun Microsystems; and Curtis Priem, who was previously a senior staff engineer and graphics chip designer at IBM and Sun Microsystems. In late 1992, the three men agreed to start the company in a meeting at a Denny's roadside diner on Berryessa Road in East San Jose. At the time, Malachowsky and Priem were frustrated with Sun's management and were looking to leave, but Huang was on \"firmer ground\", in that he was already running his own division at LSI. The three co-founders discussed a vision of the future which was so compelling that Huang decided to leave LSI and become the chief executive officer of their new startup. The three co-founders envisioned graphics-based processing as the best trajectory for tackling challenges that had eluded general-purpose computing methods. As Huang later explained: \"We also observed that video games were simultaneously one of the most computationally challenging problems and would have incredibly high sales volume. Those two conditions don't happen very often. Video games was our killer app — a flywheel to reach large markets funding huge R&D to solve massive computational problems.\" The first problem was who would quit first. Huang's wife, Lori, did not want him to resign from LSI unless Malachowsky resigned from Sun at the same time, and Malachowsky's wife, Melody, felt the same way about Huang. Priem broke that deadlock by resigning first from Sun, effective December 31, 1992. According to Priem, this put pressure on Huang and Malachowsky to not leave him to \"flail alone\", so they gave notice too. Huang left LSI and \"officially joined Priem on February 17\", which was also Huang's 30th birthday, while Malachowsky left Sun in earl"
  },
  {
    "metadata": {
      "title": "Tesla Autopilot hardware",
      "summary": "Tesla Autopilot, an advanced driver-assistance system (\"ADAS\") for Tesla vehicles, uses a suite of sensors and an onboard computer. It has undergone several hardware changes and versions since 2014, most notably moving to an all-camera-based system by 2023, in contrast with ADAS from other companies, which include radar and sometimes lidar sensors. Initially, the ADAS used a combination of cameras capturing the visual spectrum, forward-facing radar, ultrasonic proximity sensors, and a Mobileye EyeQ3 computer as Hardware 1, fitted to Model S vehicles starting in October 2014. After Mobileye ended its partnership with Tesla in 2016, Tesla began shipping cars equipped with an Nvidia Drive PX 2 computer and an increased number of cameras as Hardware 2. In 2019, Tesla shifted to a computer using a custom \"FSD Chip\" designed by Tesla, branded as Hardware 3. Starting in 2021, Tesla stopped installing the radar sensor in new vehicles, and the ADAS was updated to drop radar support. In 2022, Tesla announced it also would drop support for the ultrasonic sensors, moving the ADAS to an all-visual system. The most recent sensor and computer implementation is Hardware 4, which began shipping in January 2023.",
      "source": "https://en.wikipedia.org/wiki/Tesla_Autopilot_hardware"
    },
    "page_content": "Tesla Autopilot, an advanced driver-assistance system (\"ADAS\") for Tesla vehicles, uses a suite of sensors and an onboard computer. It has undergone several hardware changes and versions since 2014, most notably moving to an all-camera-based system by 2023, in contrast with ADAS from other companies, which include radar and sometimes lidar sensors. Initially, the ADAS used a combination of cameras capturing the visual spectrum, forward-facing radar, ultrasonic proximity sensors, and a Mobileye EyeQ3 computer as Hardware 1, fitted to Model S vehicles starting in October 2014. After Mobileye ended its partnership with Tesla in 2016, Tesla began shipping cars equipped with an Nvidia Drive PX 2 computer and an increased number of cameras as Hardware 2. In 2019, Tesla shifted to a computer using a custom \"FSD Chip\" designed by Tesla, branded as Hardware 3. Starting in 2021, Tesla stopped installing the radar sensor in new vehicles, and the ADAS was updated to drop radar support. In 2022, Tesla announced it also would drop support for the ultrasonic sensors, moving the ADAS to an all-visual system. The most recent sensor and computer implementation is Hardware 4, which began shipping in January 2023.\n\n== Physical versions ==\n\n=== Hardware 1 ===\n\nVehicles manufactured after late September 2014 are equipped with a single camera mounted at the top of the windshield, forward looking radar in the lower grille, and 12 ultrasonic acoustic location sensors in the front and rear bumpers that provide a 360-degree view around the car. The computer is the Mobileye EyeQ3; as implemented, this chip is built on a 40 nm process with a TDP of 2.5 W and a clock speed of 500 MHz. This equipment allows suitably equipped Tesla Model S and Model X vehicles to detect lane markings, obstacles, and other vehicles, enabling advanced driver-assistance functions branded Autosteer (automatic lane-keeping), Auto lane change, Autopark (parallel parking robot), and Side-collision warning. The EyeQ3 used a neural network approach, relying primarily on inputs from the camera to recognize and label objects to determine which potential areas in the camera's field of view are unoccupied and possible for the vehicle to travel through. Auto lane change can be initiated by the driver turning on the lane changing signal when safe (due to the ultrasonic sensors' 16-foot limited range capability), and then the system completes the lane change. In 2016 the system did not detect pedestrians or cyclists, and while Autopilot detects motorcycles, there have been two instances of HW1 cars rear-ending motorcycles. Tesla released a new version of Autopilot in September 2016 that changed the object detection algorithm to more fully use the radar sensor; previously, primary obstacle detection responsibilities fell to the cameras and the radar was used in a secondary role to confirm their presence, but was not given the authority to initiate emergency braking alone. After the update, the radar data was given an equal role in object detection and made capable of identifying \"dense obstacles,\" including \"other vehicles, moose, or even alien spaceships,\" according to Musk. He added that Tesla \"believes it would have\" prevented the fatal May 2016 underride crash in Williston, Florida, in which Autopilot failed to detect a white trailer against the sky. Mobileye ended its partnership with Tesla in 2016, stating that Tesla was \"going to hurt the interests of [Mobileye] and hurt the interests of an entire industry, if a company of our reputation will continue to be associated with this type of pushing the envelope in terms of safety\". Tesla responded that Mobileye backed away after learning Tesla was developing its own vision-based sensor system. Speculation immediately following the announcement included partnering with Nvidia and potentially designing its own ADAS computer. After Hardware 2 was released, an upgrade from Hardware 1 to Hardware 2 was not offered as it would have required su"
  }
]